2024-3-1/a4b7939c08-STDY.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-05-22 Wed 17:05 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>mail学习 rfc2822</title>
<meta name="author" content="Yang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">mail学习 rfc2822</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge94f734">1. 3.6.1 The origination date field(rarely used)</a></li>
<li><a href="#org6442286">2. 3.6.2 Originator fields(from/sender(rarely used)/reply-to)</a></li>
<li><a href="#orgf7c5eeb">3. 3.6.3 Destination address fields(to/cc/bcc)</a></li>
<li><a href="#org914a550">4. 3.6.4 Identification fields(message-id/in-reply-to/references)</a></li>
<li><a href="#orgbb37698">5. 3.6.5 Informational field(subject/comments(rarely-used)/keywords(rarely-used))</a></li>
<li><a href="#orge221450">6. 3.6.6 resent fields(rarely-used)</a></li>
</ul>
</div>
</div>
<p>
Message-ID: &lt;e0feef57-e609-4e14-acb0-65212a39380b@shingroup.cn&gt;
Date: Thu, 29 Feb 2024 10:26:32 +0800
MIME-Version: 1.0
User-Agent: Mozilla Thunderbird
Subject: Re: [PATCH v2] perf/hx_arm_ni: Support uncore ARM NI-700 PMU
Content-Language: en-US
From: <code>?UTF-8?B?WWFuZyBKaWFsb25nIOadqOS9s+m+mQ=</code>?= &lt;jialong.yang@shingroup.cn&gt;
To: Robin Murphy &lt;robin.murphy@arm.com&gt;, Will Deacon &lt;will@kernel.org&gt;,
 Mark Rutland &lt;mark.rutland@arm.com&gt;
Cc: shenghui.qu@shingroup.cn, linux-kernel@vger.kernel.org,
 linux-arm-kernel@lists.infradead.org
References: &lt;20240131070821.11477-1-jialong.yang@shingroup.cn&gt;
 &lt;fe3e97c0-f641-48d6-9941-837e73ae3cfe@arm.com&gt;
 &lt;7C9733413A0F8F60+0214f04d-173d-4513-ac1e-681c2f2a8de4@shingroup.cn&gt;
 &lt;8daf740f-f16b-49af-8da9-7c7750092539@arm.com&gt;
 &lt;fb75eadf-c029-4da7-bda5-300b7d7f51c1@shingroup.cn&gt;
In-Reply-To: &lt;fb75eadf-c029-4da7-bda5-300b7d7f51c1@shingroup.cn&gt;
Content-Type: text/plain; charset=UTF-8; format=flowed
Content-Transfer-Encoding: 7bit
</p>

<p>
 From d11d3c01978ef0fd8bfd125189c671c9bcc3c096 Mon Sep 17 00:00:00 2001
From: yjl00405 &lt;jialong.yang@shingroup.cn&gt;
Date: Thu, 29 Feb 2024 09:39:51 +0800
Subject: [PATCH] arm-ni:Some changes.
</p>

<p>
---
</p>
<ol class="org-ol">
<li>Some small mistakes.</li>
<li>Have not given 'NI_PMU unit-&gt;ns = true'. So no cycles event exists
in arm_ni_0_cd_0/events.</li>
</ol>
<hr>

<div id="outline-container-orge94f734" class="outline-2">
<h2 id="orge94f734"><span class="section-number-2">1.</span> 3.6.1 The origination date field(rarely used)</h2>
</div>
<div id="outline-container-org6442286" class="outline-2">
<h2 id="org6442286"><span class="section-number-2">2.</span> 3.6.2 Originator fields(from/sender(rarely used)/reply-to)</h2>
<div class="outline-text-2" id="text-2">
<p>
From: "JiaLong.Yang" &lt;jialong.yang@shingroup.cn&gt;
可逗号分隔，同时指定多个mailbox。如果多个，那必须存在sender指明唯一一个发送地址。
也就是这个邮件来个多个实体人，但发送者只能从一个人那里。
git版本默认没有sender，因此from必须一个。
from指明message的作者，写信息的人。
sender指明信息真正发送者，邮件代理人。
NOTICE: 如果作者和发送人是同一个，则sender域不能单独使用。
git send-email --from=&lt;address&gt;
</p>

<p>
Reply-To: "JiaLong.Yang" &lt;jialong.yang@shingroup.cn&gt;
from中的一员，指明信息应该是由谁回复。
</p>
</div>
</div>
<div id="outline-container-orgf7c5eeb" class="outline-2">
<h2 id="orgf7c5eeb"><span class="section-number-2">3.</span> 3.6.3 Destination address fields(to/cc/bcc)</h2>
<div class="outline-text-2" id="text-3">
<p>
To: Robin Murphy &lt;robin.murphy@arm.com&gt;, Will Deacon &lt;will@kernel.org&gt;,
 Mark Rutland &lt;mark.rutland@arm.com&gt;
Cc: shenghui.qu@shingroup.cn, linux-kernel@vger.kernel.org,
 linux-arm-kernel@lists.infradead.org
地址都可多个。
</p>

<p>
to指明信息第一接收人。
cc信息第二接收人，信息内容可能不会直接传给他们。
bcc, blind carbon copy，类似cc，但目标人不会cc/to的目标人看到。挺复杂的，看文档。
</p>
</div>
</div>

<div id="outline-container-org914a550" class="outline-2">
<h2 id="org914a550"><span class="section-number-2">4.</span> 3.6.4 Identification fields(message-id/in-reply-to/references)</h2>
<div class="outline-text-2" id="text-4">
<p>
Message-ID: &lt;e0feef57-e609-4e14-acb0-65212a39380b@shingroup.cn&gt;
References: &lt;20240131070821.11477-1-jialong.yang@shingroup.cn&gt;
 &lt;fe3e97c0-f641-48d6-9941-837e73ae3cfe@arm.com&gt;
 &lt;7C9733413A0F8F60+0214f04d-173d-4513-ac1e-681c2f2a8de4@shingroup.cn&gt;
 &lt;8daf740f-f16b-49af-8da9-7c7750092539@arm.com&gt;
 &lt;fb75eadf-c029-4da7-bda5-300b7d7f51c1@shingroup.cn&gt;
In-Reply-To: &lt;fb75eadf-c029-4da7-bda5-300b7d7f51c1@shingroup.cn&gt;
message-id有且只有一个，由生成message-id的host保证唯一性。机器可读，对人无意义。
in-reply-to/references当创建回复消息时使用。他们持有目标回复消息的message-id。
in-reply-to标识新消息要回复的目标消息, 只有一个目标。
references标识一个对话线程，线程中的信息有多个。
in-reply-to field may be used to identify the message(s) to which the new message
is a reply.
references field may be used to identify a thread of conversation.
The "references" field will contain the contents of the parent's "reference" field followed by the contents of the parent's "message-id".
Reference: parent's Reference + parent's Message-Id
如果没有parent's reference，但是有parent's in-reply-to:
Reference: parent's in-reply-to + parent's Message-Id
</p>
</div>
</div>

<div id="outline-container-orgbb37698" class="outline-2">
<h2 id="orgbb37698"><span class="section-number-2">5.</span> 3.6.5 Informational field(subject/comments(rarely-used)/keywords(rarely-used))</h2>
<div class="outline-text-2" id="text-5">
<p>
Subject: Re: [PATCH v2] perf/hx_arm_ni: Support uncore ARM NI-700 PMU
只有人可读。
当在reply中使用时，主题可以以Re: 开头，就像上面那样。不可以多字母或少字母，会导致不可预见的顺序问题。
comments是包含附加信息。
</p>
</div>
</div>

<div id="outline-container-orge221450" class="outline-2">
<h2 id="orge221450"><span class="section-number-2">6.</span> 3.6.6 resent fields(rarely-used)</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yang</p>
<p class="date">Created: 2024-05-22 Wed 17:05</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
